shapes.org
# -*- mode: Org; org-use-property-inheritance: t -*-

#+STARTUP: overview
#+FILETAGS: :emacs:




#+title:Shapes
#+PROPERTY: header-args:emacs-lisp :results none :mkdirp yes


* Core
** Load
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./core/shapes-load.el
:END:

#+begin_src emacs-lisp

(defun shapes-load (type component)
  "Load a shapeshifter COMPONENT of the given TYPE"
  (require (intern (concat "shapes-" type "-" component)) (concat config-directory type "s" "/shapes-" component ".el")))

;; shapeshifter modules
(defun shapes-module (module)
  "Load a shapeshifter MODULE by name"
  (shapes-load "module" module))

;; shapeshifter layers
(defun shapes-layer (layer)
  "Load a shapeshifter LAYER by name"
  (shapes-load "layer" layer))

;; shapeshifter extensions
(defun shapes-extend (extension)
  "Load a shapeshifter EXTENSION by name"
  (shapes-load "extension" extension))

#+end_src

** Modules
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./core/shapes-modules.el
:END:

#+begin_src emacs-lisp

;; package manager
(shapes-module "straight")

;; other modules
(shapes-module "async")

#+end_src

** Tangling
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./core/shapes-tangling.el
:END:

#+begin_src emacs-lisp

(defun custom/shapes-tangle (org-file &optional quiet)
  "Asynchronously tangle an org file."
  (let ((init-tangle-start-time (current-time))
	    (file (buffer-file-name))
	    (async-quiet-switch "-q"))
    (async-start
     `(lambda ()
	      (require 'org)
	      (add-hook 'org-babel-post-tangle-hook
			(lambda ()
				(string-match "\\(^.*/\\)\\(.*\\)\\(s?/shapes-\\)\\(.*\\)\\(.el\\)" (buffer-file-name))
				(let ((component (match-string 4 (buffer-file-name)))
				      (comp-type (match-string 2 (buffer-file-name))))
				     (end-of-buffer)
				     (insert (concat
					      "\n"
					      "(provide 'shapes-" comp-type "-" component ")\n"
					      ";;; shapes-" component ".el ends here"))
				     (save-buffer))))
		   (org-babel-tangle-file ,org-file))
     (unless quiet
       `(lambda (result)
		     (if result
			 (message "SUCCESS: %s successfully tangled (%.2fs)."
				  ,org-file
				  (float-time (time-subtract (current-time)
							     ',init-tangle-start-time)))
		       (message "ERROR: %s tangling failed." ,org-file)))))))

(defun custom/shapes-tangle-auto ()
  "Automatically tangle Org Mode files in the Emacs config directory"
  (let* ((file   (expand-file-name buffer-file-name))
	    (source (string-match (concat config-directory ".*.org$") file))
	    (shapes (string-match (concat config-directory "shapes.org$") buffer-file-name))
	    (org-confirm-babel-evaluate nil))
    (if source
	(if shapes
	    (custom/shapes-tangle file)
	  (org-babel-tangle)))))

(add-hook 'after-save-hook #'custom/shapes-tangle-auto)

#+end_src


* Layers
** UI
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./layers/shapes-ui.el
:END:
*** Text
**** Typefaces

#+begin_src emacs-lisp

;; icons
(shapes-module "all-the-icons")

#+end_src

**** Highlights

#+begin_src emacs-lisp

;; highlights
(shapes-module "rainbow-mode")

#+end_src

*** Buffer

#+begin_src emacs-lisp

;; centering
(shapes-module "olivetti")

;; line numbers
(global-set-key (kbd "C-c l") #'display-line-numbers-mode)

#+end_src

*** Frame

#+begin_src emacs-lisp

;; size
(add-to-list 'default-frame-alist '(height . 50))
(add-to-list 'default-frame-alist '(width  . 70))

;; tabs
(tab-bar-mode 1)

;; no visible scroll bar
(scroll-bar-mode -1)
;; no toolbar
(tool-bar-mode -1)
;; no tooltips
(tooltip-mode -1)
;; no menu bar
(menu-bar-mode -1)

;; title
(setq-default frame-title-format '("Emacs [%m] %b"))

#+end_src

*** Window

#+begin_src emacs-lisp

;; fringes
(set-fringe-mode nil)

;; balance
(global-set-key (kbd "C-x -") #'balance-windows)

;; split threshold
(setq split-width-threshold 70)

#+end_src

*** Warnings

#+begin_src emacs-lisp

;; visible bell
(setq visible-bell t)

#+end_src

*** Mode line

#+begin_src emacs-lisp

;; time
(display-time-mode t)

;; column numbers
(column-number-mode)

;; mode display
(shapes-module "delight")

#+end_src

*** Extensions

#+begin_src emacs-lisp

;; extensions
(shapes-extend "ui")

#+end_src

** Input
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./layers/shapes-input.el
:END:

#+begin_src emacs-lisp

;; commands
(shapes-module "god-mode")

;; confirmation
(advice-add 'yes-or-no-p :override #'y-or-n-p)

#+end_src

** Themes
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./layers/shapes-themes.el
:END:

Shapeshifter themes layer. It requires three variables to be defined: the light and dark themes (~light~ and ~dark~ respectively), and the mode line of choice (~modeline~).

#+begin_src emacs-lisp

(defcustom light 'modus-operandi
  "Light theme")
(defcustom dark  'modus-vivendi
  "Dark theme")

;; themes
(shapes-module "nano-theme")
(shapes-module "doom-themes")
(shapes-module "modus-themes")
(shapes-module "sweet-theme")
(shapes-module "graphite-theme")
(shapes-module "chocolate-theme")

;; extensions
(shapes-extend "themes")

;; scheduling
(shapes-module "circadian")

#+end_src

** Mode line
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./layers/shapes-mode-line.el
:END:

#+begin_src emacs-lisp

(defcustom modeline 'doom-modeline-mode
  "Mode line")

;; mode lines
(shapes-module "nano-modeline")
(shapes-module "doom-modeline")
(shapes-module "spaceline")

;; mode line initialization hook
(add-hook 'after-init-hook modeline)

#+end_src


** Editing
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./layers/shapes-editing.el
:END:

#+begin_src emacs-lisp

(shapes-module "vundo")
(shapes-module "multiple-cursors")

;; extensions
(shapes-extend "editing")

#+end_src


** Navigation
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./layers/shapes-navigation.el
:END:

#+begin_src emacs-lisp

;; frame
(global-set-key (kbd "C-S-n") #'make-frame-command)

;; window
(shapes-module "winner")
(shapes-module "ace-window")

;; extensions
(shapes-extend "navigation")

#+end_src


** File management
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./layers/shapes-file-management.el
:END:

~backup-directory-alist~, which determines where backups are saved, is set by ~no-littering~.

#+begin_src emacs-lisp

;; buffer backups
(setq backup-by-copying t)
(setq version-control t)
(setq delete-old-versions t)
(setq kept-new-versions 2)
(setq kept-old-versions 2)

;; file manager
(shapes-module "dirvish")

;; extensions
(shapes-extend "file-management")

#+end_src


** IDE
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./layers/shapes-ide.el
:END:

#+begin_src emacs-lisp

;; remove duplicates in shell history
(setq comint-input-ignoredups t)

;; folding
(shapes-module "hideshow")
;; completion
(shapes-module "company")
;; syntax checking
(shapes-module "flycheck")

;; lisp
(shapes-module "rainbow-delimiters")
;; python
(shapes-module "elpy")

#+end_src

** Org Mode
*** org
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./layers/shapes-org.el
:END:

#+begin_src emacs-lisp

(shapes-module "org")

;; editing
(shapes-module "org-paragraph")

;; templates
(shapes-module "org-tempo")
(shapes-module "org-capture")

;; export
(shapes-module "ox-rst")

;; notes
(shapes-module "org-diary")
(shapes-module "org-roam")

;; agenda
(shapes-module "org-agenda")
(shapes-module "org-contacts")
(shapes-module "org-calendar")

;; programming
(shapes-module "org-babel")

;; extensions
(shapes-extend "org")

#+end_src

*** org-ui
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./layers/shapes-org-ui.el
:END:

#+begin_src emacs-lisp

(shapes-module "org-modern")

#+end_src

**** Text
***** Hidden

#+begin_src emacs-lisp

(shapes-module "org-appear")

#+end_src

***** Typefaces
****** Title

#+begin_src emacs-lisp

;; title face

(defun custom/org-typeface-title ()
  (with-eval-after-load 'org-faces
    (set-face-attribute 'org-document-title nil :font typeface-title :height 300 :weight 'regular :foreground 'unspecified)))

(add-hook 'org-mode-hook #'custom/org-typeface-title)

#+end_src

****** Body

#+begin_src emacs-lisp

(defun custom/org-typefaces-body ()
  (with-eval-after-load 'org-faces

    ;; Code
    (set-face-attribute 'org-block                 nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-code                  nil                 :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim              nil                 :inherit '(shadow fixed-pitch))

    ;; Tables
    (set-face-attribute 'org-table                 nil                 :inherit '(shadow fixed-pitch))

    ;; Lists
    (set-face-attribute 'org-checkbox              nil                 :inherit 'fixed-pitch)

    ;; Meta
    (set-face-attribute 'org-meta-line             nil                 :inherit 'fixed-pitch)
    (set-face-attribute 'org-document-info         nil                 :inherit 'fixed-pitch)
    (set-face-attribute 'org-document-info-keyword nil                 :inherit 'fixed-pitch)
    (set-face-attribute 'org-special-keyword       nil                 :inherit 'fixed-pitch)))

(add-hook 'org-mode-hook #'custom/org-typefaces-body)

#+end_src

****** Indent

#+begin_src emacs-lisp

(defun custom/org-typeface-indent ()
  "Indent typeface used in `org-indent-mode' and `visual-line-mode'."
  (with-eval-after-load 'org-indent-mode
    (set-face-attribute 'org-indent                nil                 :inherit '(org-hide fixed-pitch))))

(add-hook 'org-mode-hook #'custom/org-typeface-indent)

#+end_src

****** Headings

#+begin_src emacs-lisp

;; use levels 1 through 8
(setq org-n-level-faces 8)

;; do not cycle header style after 8th level
(setq org-cycle-level-faces nil)

;; hide leading stars
(setq org-hide-leading-starts t)

;; font sizes
(defun custom/org-header-setup () 
  (with-eval-after-load 'org-faces

    ;; heading font sizes
    (dolist (face '((org-level-1 . 1.6)
                    (org-level-2 . 1.4)
                    (org-level-3 . 1.3)
                    (org-level-4 . 1.2)
                    (org-level-5 . 1.15)
                    (org-level-6 . 1.10)
                    (org-level-7 . 1.05)
                    (org-level-8 . 1.00)))
         (set-face-attribute (car face) nil :font typeface-heading :weight 'bold :height (cdr face)))))

(add-hook 'org-mode-hook #'custom/org-header-setup)

#+end_src

***** Indentation

#+begin_src emacs-lisp

;; org-indent-mode
(add-hook 'org-mode-hook #'org-indent-mode)

;; list indentation
(setq-default org-list-indent-offset 1)

#+end_src

***** Line-wrapping

#+begin_src emacs-lisp

(add-hook 'org-mode-hook (lambda () (progn (visual-line-mode 1) (setq line-move-visual t))))

#+end_src

***** Pretty entities

#+begin_src emacs-lisp

;; symbols, super- and subscripts
(setq org-pretty-entities nil)

#+end_src

**** Icons
***** Ellipses

Candidates:
- triangles
  ▼
  ▾
  ▿
- rhomboids
  ⬙
  ⟡
  ⬥
  ♦
  ♢
- non-compliant
  ⧨
  
-----

#+begin_src emacs-lisp

;; Change ellipsis ("...") to remove clutter
(setq org-ellipsis " ♢")

#+end_src

**** Figures

#+begin_src emacs-lisp

;; startup with inline images
(setq org-startup-with-inline-images t)

;; no actual width
(setq org-image-actual-width nil)

;; drag and drop
(shapes-module "org-download")

#+end_src

*** TODO org-latex-preview
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./layers/shapes-org-latex-preview.el
:END:

- org LaTeX equations
   - custom array envs
      - cases
         - \arraycolsep=1.4pt\def\arraystretch{1.5}
      - derivations
         - \arraycolsep=3pt\def\arraystretch{2.25}

#+begin_src emacs-lisp

(shapes-module "org-fragtog")

#+end_src

