shapes.org
**** god-mode
:PROPERTIES:
:header-args: emacs-lisp :tangle ./modules/shapes-god-mode.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'god-mode)
(require 'god-mode)

;; god
(global-set-key (kbd "<escape>") #'god-mode-all)

;; local
(define-key god-local-mode-map (kbd "i") #'god-local-mode)

;; bindings
(define-key god-local-mode-map (kbd ".") #'repeat)
(define-key god-local-mode-map (kbd "]") #'forward-paragraph)
(define-key god-local-mode-map (kbd "[") #'backward-paragraph)

#+end_src

** Themes
*** Themes
**** Nano
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-nano-theme.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'nano-theme)
(require 'nano-theme)

#+end_src

**** Doom
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-doom-themes.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'doom-themes)
(require 'doom-themes)

#+end_src

**** Modus
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-modus-themes.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'modus-themes)
(modus-themes-load-themes)

#+end_src

Commit 64c8009 of July the 8th 2022 dresses Org Mode titles with a ghastly cyan
in ~modus-operandi~, and a strident turquoise in ~modus-vivendi~. This can be undone
by passing the ~monochrome~ attribute to 0th level heading in ~modus-themes-headings~.

#+begin_src emacs-lisp

(setq modus-themes-headings
      '((0 . (monochrome))))

#+end_src

**** Standalone
***** Sweet
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-sweet-theme.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'sweet-theme)
(require 'sweet-theme)

#+end_src

***** Graphite
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-graphite-theme.el
:END:

#+begin_src emacs-lisp

(straight-use-package '(graphite-theme :type git :host github :repo "codemicmaves/graphite-theme"))
(require 'graphite-light-theme)
(require 'graphite-dark-theme)

#+end_src

***** Chocolate
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-chocolate-theme.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'chocolate-theme)
(require 'chocolate-theme)

#+end_src

*** Scheduling
**** circadian
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-circadian.el
:END:

#+begin_src emacs-lisp

(setq calendar-latitude      52.00667)
(setq calendar-longitude     4.355561)
(setq calendar-loadtion-name "Delft")
(setq calendar-standard-time-zone-name "CEST")
(setq calendar-daylight-time-zone-name "CET")

(straight-use-package 'circadian)
(setq circadian-themes `((:sunrise . ,light)  
			      (:sunset  . ,dark)))
(circadian-setup)

#+end_src

** Mode line
*** Nano
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-nano-modeline.el
:END:

#+begin_src emacs-lisp

;; nano-modeline
(straight-use-package 'nano-modeline)

#+end_src

*** Doom
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-doom-modeline.el
:END:

#+begin_src emacs-lisp

;; doom-modeline
(straight-use-package 'doom-modeline)

;; bar
(setq-default doom-modeline-bar-width 0.01)

#+end_src

*** Spaceline
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-spaceline.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'spaceline)
(require 'spaceline-config)

#+end_src


** Editing
*** Undo
**** TODO vundo
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-vundo.el
:END:

- undo-fu
- Back
   - Record character number in current line relative to the end of the line
   - If impossible to go to previous position, to recorded character number of previous line
   - Org Mode
      - restore visibility before undone command
      - if previous command created heading
         - undo heading creation and restore visibility

#+begin_src emacs-lisp

;; vundo
(straight-use-package 'vundo)

(global-set-key (kbd "C-v") #'vundo)

#+end_src

**** undo-tree                                                        :arch:
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-undo-tree.el
:END:

#+begin_src emacs-lisp

;; undo-tree
(use-package undo-tree
  :bind (("M-/" . undo-tree-visualize)
         :map undo-tree-visualizer-mode-map
         ("RET" . undo-tree-visualizer-quit)
         ("ESC" . undo-tree-visualizer-quit))
  :config
  (global-undo-tree-mode))

#+end_src

***** Visualize in side buffer

#+begin_src emacs-lisp

;; visualize in side buffer
(defun custom/undo-tree-split-side-by-side (orig-fun &rest args)
  "Split undo-tree side-by-side"
  (let ((split-height-threshold nil)
        (split-width-threshold 0))
    (apply orig-fun args)))

(advice-add 'undo-tree-visualize :around #'custom/undo-tree-split-side-by-side)

#+end_src

*** Multiline
**** multiple-cursors
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-multiple-cursors.el
:END:

#+begin_src emacs-lisp

;; Multiple cursors
(straight-use-package 'multiple-cursors)
(require 'multiple-cursors)

;; mc-lists
(setq mc/list-file (concat config-directory "persistent/mc-lists.el"))

;; Create cursors
(global-set-key (kbd "C-.")         #'mc/mark-next-like-this)
(global-set-key (kbd "C-;")         #'mc/mark-previous-like-this)
(global-set-key (kbd "C-<mouse-1>") #'mc/add-cursor-on-click)
(global-unset-key [C-down-mouse-1]) ; necessary

;; Return as usual
(define-key mc/keymap (kbd "<return>")       #'electric-newline-and-maybe-indent)

;; Exit multiple-cursors-mode
(define-key mc/keymap (kbd "<escape>")       #'multiple-cursors-mode)
(define-key mc/keymap (kbd "<mouse-1>")      #'multiple-cursors-mode)
(define-key mc/keymap (kbd "<down-mouse-1>")   nil) ; necessary

#+end_src
** Search
*** swiper
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-swiper.el
:END:

#+begin_src emacs-lisp

;; Swiper
(straight-use-package 'swiper)
(require 'swiper)

#+end_src

**** isearch

#+begin_src emacs-lisp

(defun custom/swiper-isearch (orig-fun &rest args)
  "`swiper-isearch' the selected region. If none are, `swiper-isearch'."
  (if (region-active-p)
      (let ((beg (region-beginning))
	    (end (region-end)))
	(deactivate-mark)
	(apply orig-fun (list (buffer-substring-no-properties beg end))))
    (apply orig-fun args)))

(advice-add 'swiper-isearch :around #'custom/swiper-isearch)

(define-key global-map (kbd "C-s") #'swiper-isearch)

#+end_src

**** TODO Narrow search

- C-r in swiper -> quit, widen

#+begin_src emacs-lisp

(defun custom/narrow-and-search (beg end)
  "Narrow to region and trigger swiper search."
  (narrow-to-region beg end)
  (deactivate-mark)
  (swiper-isearch))

(defun custom/search-in-region (beg end)
  "Narrow and search active region. If the current
buffer is already narrowed, widen buffer."
  (interactive (if (use-region-p)
                   (list (region-beginning) (region-end))
                 (list nil nil)))
  (if (not (buffer-narrowed-p))
      (if (and beg end)
	  (progn (custom/narrow-and-search beg end)))
    (progn (widen)
	   (if (bound-and-true-p multiple-cursors-mode)
	       (mc/disable-multiple-cursors-mode)))))

(defun custom/swiper-exit-narrow-search ()
  (interactive)
  (minibuffer-keyboard-quit)
  (if (buffer-narrowed-p)
      (widen)))

;; Narrow search
(define-key global-map (kbd "C-r") #'custom/search-in-region)

;; Exit narrow search from swiper
(define-key swiper-map (kbd "C-e") #'custom/swiper-exit-narrow-search)

#+end_src

**** Multiple cursors

#+begin_src emacs-lisp

(defun custom/swiper-multiple-cursors ()
  (interactive)
  (swiper-mc)
  (minibuffer-keyboard-quit))

;; M-RET: multiple-cursors-mode
(define-key swiper-map (kbd "M-<return>") #'custom/swiper-multiple-cursors)

#+end_src

*** ripgrep
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-rg.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'rg)
(require 'rg)

#+end_src
** Templates
*** yasnippet
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-yasnippet.el
:END:

#+begin_src emacs-lisp

;; yasnippet
(straight-use-package 'yasnippet)

(yas-global-mode 1)

#+end_src

**** <

#+begin_src emacs-lisp

(defun custom/<-snippet (orig-fun &rest args)
  "Require < before snippets."
  (interactive)
  (setq line (buffer-substring-no-properties (line-beginning-position) (line-end-position)))
	(if (not (string-equal line ""))
	    (if (string-equal (substring line 0 1) "<")
		(progn (save-excursion (move-beginning-of-line nil)
				       (right-char 1)
				       (delete-region (line-beginning-position) (point)))
		       (apply orig-fun args)))))

(advice-add 'yas-expand :around #'custom/<-snippet)

#+end_src

**** Snippets

#+begin_src emacs-lisp

;; yasnippet-snippets
(straight-use-package 'yasnippet-snippets)

#+end_src

** Completion
*** ivy
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-ivy.el
:END:

#+begin_src emacs-lisp

;; ivy
(straight-use-package 'ivy)
(require 'ivy)

(ivy-mode 1)

;; minibuffer bindings
(let ((map ivy-minibuffer-map))
  (cl-loop for binding in '(("<tab>"       . ivy-alt-done)
			        ("<up>"        . ivy-previous-line-or-history)
			        ("C-l"         . ivy-alt-done)
			        ("C-j"         . ivy-next-line)
			        ("C-k"         . ivy-previous-line)
			        ("<backspace>" . ivy-backward-delete-char))
            collect (define-key map (kbd (car binding)) (cdr binding))))

;; switch-buffer bindings
(let ((map ivy-switch-buffer-map))
  (cl-loop for binding in '(("C-k"   . ivy-previous-line)
 			        ("C-l"   . ivy-done)
			        ("C-d"   . ivy-switch-buffer-kill))
            collect (define-key map (kbd (car binding)) (cdr binding))))

;; reverse-i-search bindings
(let ((map ivy-reverse-i-search-map))
  (cl-loop for binding in '(("C-k"   . ivy-previous-line)
			        ("C-d"   . ivy-reverse-i-search-kill))
            collect (define-key map (kbd (car binding)) (cdr binding))))

#+end_src

*** ivy-rich                                                          :arch:
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-ivy-rich.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'ivy-rich)
(require 'ivy-rich)

(ivy-rich-mode 1)

#+end_src


** Workflow
*** Session
**** desktop
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-desktop.el
:END:

#+begin_src emacs-lisp

(desktop-save-mode 1)

#+end_src

**** TODO workgroups
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-workgroups.el
:END:

- workgroups
  - relative paths wrt project root (for files in same projectile project ?)

#+begin_src emacs-lisp

(straight-use-package 'workgroups)
(require 'workgroups)

(setq wg-prefix-key (kbd "C-c w"))

;; save commands
(define-key wg-map (kbd "s")   #'wg-save)
(define-key wg-map (kbd "C-s") #'wg-update-all-workgroups-and-save)

;; suppress animation
(setq wg-morph-on nil)

(workgroups-mode 1)

#+end_src

*** Project interaction
**** TODO projectile
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-projectile.el
:END:

- project dashboard
   - flow
      1. tabulated-list-mode
          - display known projects
      2. Either
          - Choose project
             1. workgroups.el
                 1. If no .workspace, create .workspace
                 2. Load .workspace
          - Create new project
             1. Template
             2. workgroups.el
                 1. New .workspace file
                 2. Load .workspace
   - references
      - Issue
         - https://github.com/bbatsov/projectile/issues/967
      - SpaceMacs
         - https://github.com/syl20bnr/spacemacs/blob/master/core/core-spacemacs-buffer.el#L550

#+begin_src emacs-lisp

;; projectile
(straight-use-package 'projectile)
(require 'projectile)

(projectile-mode)

;; command map prefix
(define-key projectile-mode-map (kbd "M-p") 'projectile-command-map)

#+end_src

**** treemacs
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-treemacs.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'treemacs)
(require 'treemacs)

#+end_src

***** Filter

#+begin_src emacs-lisp

(defvar custom/treemacs-ignored '(".*__pycache__.*")
  "Files and directories ignored by treemacs")

(defun custom/treemacs-ignore-filter (file _)
  (cl-loop for ignored in custom/treemacs-ignored
	   if (string-match ignored file)
	      return t
	   finally return nil))
(push #'custom/treemacs-ignore-filter treemacs-ignored-file-predicates)

#+end_src

