shapes.org
***** Bindings

#+begin_src emacs-lisp

(cl-loop for binding in '(("M-0"       . treemacs-select-window)
			      ("C-x t 1"   . treemacs-delete-other-windows)
			      ("C-x t t"   . treemacs)
			      ("C-x t d"   . treemacs-select-directory)
			      ("C-x t B"   . treemacs-bookmark)
			      ("C-x t C-t" . treemacs-find-file)
			      ("C-x t M-t" . treemacs-find-tag))
	 collect (global-set-key (kbd (car binding)) (cdr binding)))

#+end_src

***** Settings

#+begin_src emacs-lisp

(setq treemacs-collapse-dirs                   (if treemacs-python-executable 3 0)
      treemacs-deferred-git-apply-delay        0.5
      treemacs-directory-name-transformer      #'identity
      treemacs-display-in-side-window          t
      treemacs-eldoc-display                   'simple
      treemacs-file-event-delay                5000
      treemacs-file-extension-regex            treemacs-last-period-regex-value
      treemacs-file-follow-delay               0.2
      treemacs-file-name-transformer           #'identity
      treemacs-follow-after-init               t
      treemacs-expand-after-init               t
      treemacs-find-workspace-method           'find-for-file-or-pick-first
      treemacs-git-command-pipe                ""
      treemacs-goto-tag-strategy               'refetch-index
      treemacs-indentation                     2
      treemacs-indentation-string              " "
      treemacs-is-never-other-window           nil
      treemacs-max-git-entries                 5000
      treemacs-missing-project-action          'ask
      treemacs-move-forward-on-expand          nil
      treemacs-no-png-images                   nil
      treemacs-no-delete-other-windows         t
      treemacs-project-follow-cleanup          nil
      treemacs-persist-file                    (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
      treemacs-position                        'left
      treemacs-read-string-input               'from-child-frame
      treemacs-recenter-distance               0.1
      treemacs-recenter-after-file-follow      nil
      treemacs-recenter-after-tag-follow       nil
      treemacs-recenter-after-project-jump     'always
      treemacs-recenter-after-project-expand   'on-distance
      treemacs-litter-directories              '("/node_modules" "/.venv" "/.cask")
      treemacs-show-cursor                     nil
      treemacs-show-hidden-files               t
      treemacs-silent-filewatch                nil
      treemacs-silent-refresh                  nil
      treemacs-sorting                         'alphabetic-asc
      treemacs-select-when-already-in-treemacs 'move-back
      treemacs-space-between-root-nodes        t
      treemacs-tag-follow-cleanup              t
      treemacs-tag-follow-delay                1.5
      treemacs-text-scale                      nil
      treemacs-user-mode-line-format           nil
      treemacs-user-header-line-format         nil
      treemacs-wide-toggle-width               70
      treemacs-width                           35
      treemacs-width-increment                 1
      treemacs-width-is-initially-locked       t
      treemacs-workspace-switch-cleanup        nil)

;; The default width and height of the icons is 22 pixels. If you are
;; using a Hi-DPI display, uncomment this to double the icon size.
;; (treemacs-resize-icons 44)

(treemacs-follow-mode t)
(treemacs-filewatch-mode t)
(treemacs-fringe-indicator-mode 'always)

(pcase (cons (not (null (executable-find "git")))
             (not (null treemacs-python-executable)))
  (`(t . t)
   (treemacs-git-mode 'deferred))
  (`(t . _)
   (treemacs-git-mode 'simple)))

(treemacs-hide-gitignored-files-mode nil)

#+end_src

***** Extensions

#+begin_src emacs-lisp

(straight-use-package 'treemacs-icons-dired)

(straight-use-package 'treemacs-projectile)

(straight-use-package 'treemacs-tab-bar)

(straight-use-package 'treemacs-magit)

#+end_src

** Guidance
*** counsel
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-counsel.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'counsel)
(require 'counsel)

(global-set-key (kbd "<menu>") #'counsel-M-x)

#+end_src

*** helpful
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-helpful.el
:END:

#+begin_src emacs-lisp

;; replace description key bindings by their helpful equivalents
(straight-use-package 'helpful)

(setq counsel-describe-function-function  #'helpful-callable)
(setq counsel-describe-variable-function  #'helpful-variable)

(global-set-key [remap describe-function] #'helpful-function)
(global-set-key [remap describe-command]  #'helpful-command)
(global-set-key [remap describe-variable] #'helpful-variable)
(global-set-key [remap describe-key]      #'helpful-key)

#+end_src

*** which-key
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-which-key.el
:END:

#+begin_src emacs-lisp

;; command suggestions
(straight-use-package 'which-key)
(require 'which-key)

(setq which-key-idle-delay 1.0)

(which-key-mode)

#+end_src

*** command-log-mode                                                  :arch:
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-command-log-mode.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'command-log-mode)
(require 'command-log-mode)

(global-command-log-mode)

#+end_src

** Navigation
*** winner
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-winner.el
:END:

#+begin_src emacs-lisp

(winner-mode)

#+end_src

*** ace-window
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-ace-window.el
:END:

#+begin_src emacs-lisp

;; ace-window
(straight-use-package 'ace-window)
(require 'ace-window)

(global-set-key (kbd "C-x o") 'ace-window)

#+end_src

*** TODO pixel-scroll-precision
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-pixel-scroll-precision.el
:END:

- pixel-scroll-precision-mode
   - sudden jumps

- scrolling without moving mark

- sources
   - https://www.reddit.com/r/emacs/comments/6osik2/random_scroll_jumps_in_emacs/
   - https://www.emacswiki.org/emacs/SmoothScrolling

#+begin_src emacs-lisp

(setq scroll-step 1)
(setq scroll-conservatively 101)
(setq scroll-preserve-screen-position 1)

#+end_src


** Version control
*** magit
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-magit.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'magit)
(require 'magit)

(global-set-key (kbd "C-x g") #'magit-status)

#+end_src

** File management
*** dirvish
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-dirvish.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'dirvish)
(require 'dirvish)

;; override dired
(dirvish-override-dired-mode)

#+end_src


** IDE
*** General
**** hideshow
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-hideshow.el
:END:

#+begin_src emacs-lisp

(require 'hideshow)

(add-hook 'prog-mode-hook #'hs-minor-mode)

#+end_src

***** TODO Cycle

- fold back in 1 when no children

#+begin_src emacs-lisp

(defun custom/hs-cycle (&optional level)
  (interactive "p")
  (save-excursion
    (let (message-log-max (inhibit-message t))
      (if (= level 1)
	  (pcase last-command
	    ('hs-cycle
	     (hs-hide-level 1)
	   (setq this-command 'hs-cycle-children))
	    ('hs-cycle-children
	     ;; TODO: Fix this case. `hs-show-block' needs to be
	     ;; called twice to open all folds of the parent
	     ;; block.
	     (save-excursion (hs-show-block))
	     (hs-show-block)
	     (setq this-command 'hs-cycle-subtree))
	    ('hs-cycle-subtree
	     (hs-hide-block))
	    (_
	     (if (not (hs-already-hidden-p))
		 (hs-hide-block)
	       (hs-hide-level 1)
	       (setq this-command 'hs-cycle-children))))
	(hs-hide-level level)
	(setq this-command 'hs-hide-level)))))

(defun custom/hs-global-cycle ()
  (interactive)
  (pcase last-command
    ('hs-global-cycle
     (save-excursion (hs-show-all))
     (setq this-command 'hs-global-show))
    (_ (hs-hide-all))))

(define-key hs-minor-mode-map (kbd "C-\\") #'custom/hs-cycle)

#+end_src

**** company
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-company.el
:END:

#+begin_src emacs-lisp

;; company
(straight-use-package 'company)
(require 'company)

#+end_src

**** flycheck
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-flycheck.el
:END:

#+begin_src emacs-lisp

;; flycheck
(straight-use-package 'flycheck)
(require 'flycheck)

(add-hook 'prog-mode-hook #'flycheck-mode)

#+end_src

*** Specific
**** Lisp
***** Syntax highlighting
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-rainbow-delimiters.el
:END:

#+begin_src emacs-lisp

;; rainbow-delimieters
(straight-use-package 'rainbow-delimiters)
(require 'rainbow-delimiters)

;; enable rainbow delimiters on all programming modes
(add-hook 'prog-mode-hook 'rainbow-delimiters-mode)

#+end_src

**** Python
***** elpy
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-elpy.el
:END:

#+begin_src bash :tangle no

sudo apt-get install python3-venv

#+end_src

#+begin_src emacs-lisp

;; elpy
(straight-use-package 'elpy)
(elpy-enable)

#+end_src

****** RPC

#+begin_src emacs-lisp

(setq elpy-rpc-timeout 5)

(setq elpy-rpc-backend "jedi")

(setq elpy-rpc-python-command "python3")

#+end_src

****** Navigation

#+begin_src emacs-lisp

(define-key elpy-mode-map (kbd "C-M-n") 'elpy-nav-forward-block)
(define-key elpy-mode-map (kbd "C-M-p") 'elpy-nav-backward-block)

#+end_src

** Org Mode
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-org.el
:END:

#+begin_src emacs-lisp

;; Org Mode
(straight-use-package 'org)
(require 'org)

#+end_src

*** Patches
