shapes.org
***** Timestamps

#+begin_src emacs-lisp

;; org-roam-timestamps
(straight-use-package 'org-roam-timestamps)
(require 'org-roam-timestamps)

;; remember
(setq org-roam-timestamps-remember-timestamps nil)
(setq org-roam-timestamps-minimum-gap 3600)

;; visit hook
(add-hook 'custom/org-roam-node-visit-hook #'org-roam-timestamps-mode)

;; capture hook
(defvar custom/org-roam-timestamps-mode-active-before-capture nil)

(defun custom/org-roam-timestamps-mode-off ()
  "Disable `org-roam-timestamps-mode' in Org Roam capture buffers."
  (setq custom/org-roam-timestamps-mode-active-before-capture org-roam-timestamps-mode)
  (org-roam-timestamps-mode -1))
(add-hook 'org-roam-capture-new-node-hook #'custom/org-roam-timestamps-mode-off)

(defun custom/org-roam-timestamps-mode-back ()
  "Re-enable `org-roam-timestamps-mode' after finalizing capture,
if it was previously enabled."
  (if custom/org-roam-timestamps-mode-active-before-capture
      (org-roam-timestamps-mode)))
(add-hook 'org-capture-after-finalize-hook #'custom/org-roam-timestamps-mode-back)

#+end_src

*** Export
**** ox-rst
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-ox-rst.el
:END:

#+begin_src emacs-lisp

;; ox-rst
(straight-use-package 'ox-rst)
(require 'ox-rst)

#+end_src

*** Agenda
**** org-agenda
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-org-agenda.el
:END:

#+begin_src emacs-lisp

;; org-agenda
(global-set-key (kbd "C-c a") 'org-agenda)

#+end_src

***** TODO Files

- recursive search
   - (directory-files-recursively "/home/" "\\.org$")
   - https://stackoverflow.com/questions/11384516/how-to-make-all-org-files-under-a-folder-added-in-agenda-list-automatically

#+begin_src emacs-lisp

;; org-agenda-files
(setq org-agenda-files (append org-agenda-files
			       `(,config-directory)))

#+end_src

***** Display
****** Tag alignment

#+begin_src emacs-lisp

;; Tag indentation
(setq org-tags-column 70)

#+end_src

***** Agenda
****** Editing

#+begin_src emacs-lisp

;; Mark items as done
(defun custom/org-agenda-todo-done ()
  (interactive)
  (org-agenda-todo 'done))

(define-key org-agenda-mode-map (kbd "d") 'custom/org-agenda-todo-done)

#+end_src

****** Display
******* Views

#+begin_src emacs-lisp

;; Configure custom agenda views
(setq org-agenda-custom-commands
      '(("d" "Dashboard"
	      ((agenda "" ((org-deadline-warning-days 7)))
	       (todo "NEXT" ((org-agenda-overriding-header "Next Tasks")))
	       (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

	     ("n" "Next Tasks"
	      ((todo "NEXT" ((org-agenda-overriding-header "Next Tasks")))))

	     ("w" "Work Tasks" tags-todo "work")

	     ("e" "Emacs Tasks" tags-todo "emacs")

	     ("z" "Low Effort" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
	      ((org-agenda-overriding-header "Low Effort Tasks")
	       (org-agenda-max-todos 20)
	       (org-agenda-files org-agenda-files)))

	     ("s" "Workflow Status"
	      ((todo "WAIT"
		     ((org-agenda-overriding-header "Waiting on External")
		      (org-agenda-files org-agenda-files)))
	       (todo "REVIEW"
		     ((org-agenda-overriding-header "In Review")
		      (org-agenda-files org-agenda-files)))
	       (todo "PLAN"
		     ((org-agenda-overriding-header "In Planning")
		      (org-agenda-todo-list-sublevels nil)
		      (org-agenda-files org-agenda-files)))
	       (todo "BACKLOG"
		     ((org-agenda-overriding-header "Project Backlog")
		      (org-agenda-todo-list-sublevels nil)
		      (org-agenda-files org-agenda-files)))
	       (todo "READY"
		     ((org-agenda-overriding-header "Ready for Work")
		      (org-agenda-files org-agenda-files)))
	       (todo "ACTIVE"
		     ((org-agenda-overriding-header "Active Projects")
		      (org-agenda-files org-agenda-files)))
	       (todo "COMPLETED"
		     ((org-agenda-overriding-header "Completed Projects")
		      (org-agenda-files org-agenda-files)))
	       (todo "CANC"
		     ((org-agenda-overriding-header "Cancelled Projects")
		      (org-agenda-files org-agenda-files)))))))

#+end_src

******* log-mode
:LOGBOOK:
- State "DONE"       from "BACKLOG"    [2022-05-12 Thu 22:00]
- State "DONE"       from "NEXT"       [2022-05-12 Thu 21:59]
- State "DONE"       from "BACKLOG"    [2022-05-12 Thu 21:59]
- State "DONE"       from "NEXT"       [2022-05-12 Thu 21:59]
- State "HOLD"       from "WAIT"       [2022-05-12 Thu 21:59]
- State "DONE"       from "NEXT"       [2022-05-12 Thu 21:59]
:END:

#+begin_src emacs-lisp

;; Org Agenda log mode
(setq org-agenda-start-with-log-mode t)
(setq org-log-done 'time)
(setq org-log-into-drawer t)

#+end_src

****** Navigation
******* TODO Visit

- org-recenter -> unfold -> move away -> fold back
   - arrows -> fold previous item
   - recenter -> unfold item
- currently- 
   - org-recenter -> all todo items unfolded

#+begin_src emacs-lisp :tangle no

(defun custom/org-agenda-recenter (arg)
  (interactive "P")
  (let ((last-called (get this-command 'custom/last-call-time)))
    (if (eq last-command this-command)
        (progn (custom/org-restore-outline-state)
	       (org-agenda-recenter arg))
      (progn (custom/org-save-outline-state)
	     (org-agenda-recenter arg))))
  (put this-command 'custom/last-call-time (current-time)))

(define-key org-agenda-mode-map (kbd "<tab>") 'org-agenda-recenter)

#+end_src

***** Classification
****** Tags

#+begin_src emacs-lisp

(setq org-tag-alist
      '((:startgroup)
	;; Put mutually exclusive tags here
	(:endgroup)
	("errand"   . ?e)
	("home"     . ?h)
	("work"     . ?w)
	("agenda"   . ?a)
	("planning" . ?p)
	("publish"  . ?P)
	("batch"    . ?b)
	("note"     . ?n)
	("idea"     . ?i)))

#+end_src

****** Keywords

#+begin_src emacs-lisp

;; Define TODO keyword sequences
(setq org-todo-keywords
      '((sequence "TODO(t)" "NEXT(n)" "WAIT(w@/!)" "|" "DONE(d!)")
	    (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(r)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))

#+end_src

**** org-contacts
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-org-contacts.el
:END:

#+begin_src emacs-lisp

;; org-contacts
(straight-use-package
 '(org-contacts :type git :host nil :repo "https://repo.or.cz/org-contacts.git"))
(require 'org-contacts)

(global-set-key (kbd "C-x c") 'org-capture)

#+end_src

***** Template

#+begin_src emacs-lisp

(defvar custom/org-capture-contacts "* %(org-contacts-template-name)
:PROPERTIES:
:ADDRESS: %^{289 Cleveland St. Brooklyn, 11206 NY, USA}
:BIRTHDAY: %^{yyyy-mm-dd}
:EMAIL: %(org-contacts-template-email)
:NOTE: %^{NOTE}
:END:" "org-contacts template")

(setq org-capture-templates
   `(("c" "contact" entry
      (file ,(nth 0 org-contacts-files))
      ,custom/org-capture-contacts)))

#+end_src

**** org-calendar
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-org-calendar.el
:END:
***** calfw

#+begin_src emacs-lisp

(straight-use-package 'calfw)
(straight-use-package 'calfw-org)
(straight-use-package 'calfw-ical)

;; org-agenda configuration is lost otherwise
(with-eval-after-load 'org-agenda
  (require 'calfw-org)
  (require 'calfw-ical))

#+end_src

***** org-calendar

#+begin_src emacs-lisp

(defun custom/org-calendar ()
  "Open `calfw' Org Agenda calendar."
  (interactive)
  (require 'org-agenda)
  (let ((inhibit-message t))
       (cfw:open-org-calendar)))

(global-set-key (kbd "C-c c") 'custom/org-calendar)

#+end_src

*** Templates
**** org-tempo
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-org-tempo.el
:END:

#+begin_src emacs-lisp

;; required as of Org 9.2
(require 'org-tempo)

;; navigation
(global-set-key (kbd "C-<tab>")         'tempo-forward-mark)
(global-set-key (kbd "C-<iso-lefttab>") 'tempo-backward-mark)

#+end_src

***** LaTeX

#+begin_src emacs-lisp

;; equations
(tempo-define-template "latex-equation"
		          '("#+NAME: eq:" p n
			    "\\begin{equation}" n
			    p n
			    "\\end{equation}" >)
			  "<eq"
			  "LaTeX equation template")

(tempo-define-template "latex-derivation"
		          '("#+NAME: eq:" p n
			    "\\begin{equation}" n
			    "\\arraycolsep=3pt\\def\\arraystretch{2.25}" n
			    "\\begin{array}{lll}" n
			    p n
			    "\\end{array}" n
			    "\\end{equation}" >)
			  "<de"
			  "LaTeX derivation template")

#+end_src

***** Figures

#+begin_src emacs-lisp

;; figures
(tempo-define-template "figure"
		          '("#+NAME: fig:" p n
			    "#+CAPTION: " p n
			    "#+ATTR_ORG: :width 450" n
			    "[[./" p "]]" >)
			  "<f"
			  "Org Mode figure template")

#+end_src

***** Code blocks

#+begin_src emacs-lisp

(defun custom/tempo-code-block (key language)
  (tempo-define-template language
		         `("#+begin_src " ,language n
			   n
			   p n
			   n
			   "#+end_src" >)
			 key
			 language))

(dolist (pair '(("<sh"   "shell")
		   ("<el"   "emacs-lisp")
		   ("<py"   "python")
		   ("<bash" "bash")))
  (apply 'custom/tempo-code-block pair))

#+end_src

**** org-capture
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-org-capture.el
:END:

#+begin_src emacs-lisp

(require 'org-capture)

#+end_src

***** TODO Templates

- lecture
   - specify directory
   - template

*** Programming
**** org-babel
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./modules/shapes-org-babel.el
:END:
***** Languages

#+begin_src emacs-lisp

;; Language packages
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python     . t)
   (shell      . t)))

#+end_src

****** Bash

#+begin_src emacs-lisp

(defun org-babel-bash-initiate-session (&optional session _params)
  "Initiate a bash/sh session named SESSION according to PARAMS."
  (org-babel-sh-initiate-session session _params))

#+end_src

****** Python

#+begin_src emacs-lisp

(setq org-babel-python-command "python3")

#+end_src

